podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/CT16B0_LPC11xx.svd.xml
            <register>
               <name>CTCR</name>
               <description>Count Control Register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>CTM</name>
                     <description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer&apos;s Prescale Counter (PC), or clear PC and increment Timer Counter (TC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>TIMERMODE</name>
                           <description>Timer Mode: every rising PCLK edge</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISINGEDGE</name>
                           <description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLLINGEDGE</name>
                           <description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISINGFALLINGEDGE</name>
                           <description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIS</name>
                     <description>Count Input Select. In counter mode (when bits 1:0 in this register are not 00), these bits select which CAP pin is sampled for clocking. 
						Note: If Counter mode is selected in the CTCR register, bits 2:0 in the Capture Control Register (CCR) must be programmed as 000</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CT16BN_CAP0</name>
                           <description>CT16Bn_CAP0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16BN_CAP1</name>
                           <description>CT16Bn_CAP1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENCC</name>
                     <description>Setting this bit to one enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELCC</name>
                     <description>When bit 4 is one, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is zero</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISING_EDGE_OF_CAP0_</name>
                           <description>Rising Edge of CAP0 clears the timer (if bit 4 is set)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING_EDGE_OF_CAP0</name>
                           <description>Falling Edge of CAP0 clears the timer (if bit 4 is set)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_EDGE_OF_CAP1_</name>
                           <description>Rising Edge of CAP1 clears the timer (if bit 4 is set)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING_EDGE_OF_CAP1</name>
                           <description>Falling Edge of CAP1 clears the timer (if bit 4 is set)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC</name>
               <description>PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT16B0_MAT[2:0]</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>PWMEN0</name>
                     <description>PWM channel0 enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CT16BN_MAT0_IS_CONTR</name>
                           <description>CT16Bn_MAT0 is controlled by EM0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM_MODE_IS_ENABLED_</name>
                           <description>PWM mode is enabled for CT16Bn_MAT0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN1</name>
                     <description>PWM channel1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CT16BN_MAT1_IS_CONTR</name>
                           <description>CT16Bn_MAT1 is controlled by EM1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM_MODE_IS_ENABLED_</name>
                           <description>PWM mode is enabled for CT16Bn_MAT1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN2</name>
                     <description>PWM channel2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MATCH_CHANNEL_2_OR_P</name>
                           <description>Match channel 2 or pin CT16B0_MAT2 is controlled by EM2. Match channel 2 is not pinned out on timer 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM_MODE_IS_ENABLED_</name>
                           <description>PWM mode is enabled for match channel 2 or pin CT16B0_MAT2</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN3</name>
                     <description>PWM channel3 enable Note: It is recommended to use match channel 3 to set the PWM cycle because it is not pinned out</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MATCH_CHANNEL_3_MATC</name>
                           <description>Match channel 3 match channel 3 is controlled by EM3</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM_MODE_IS_ENABLED_</name>
                           <description>PWM mode is enabled for match channel 3match channel 3</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
